In [1]:
import pandas as pd
import numpy as np

# 합치기

## concat 함수

pd.concat(객체, axis=0, join="outer", join_axes=None, ignore_index=False, keys=None, levels=None, names=None, verify_integrity=False, copy=True)
* 객체: 시리즈, 데이터프레임, 패널 등 -- 즉, 합칠 대상
* axis: 위아래로 합칠꺼냐 좌우로 합칠꺼냐
* join: 합집합이냐 교집합이냐
* ignore_index: 인덱스를 무시할꺼냐

### axis

In [2]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
    'B': ['B0', 'B1', 'B2'],
    'C': ['C0', 'C1', 'C2'],
    'D': ['D0', 'D1', 'D2']},
    index=[0, 1, 2])

df2 = pd.DataFrame({'A': ['A3', 'A4', 'A5'],
    'B': ['B3', 'B4', 'B5'],
    'C': ['C3', 'C4', 'C5'],
    'D': ['D3', 'D4', 'D5']},
    index=[3, 4, 5])

In [3]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2

In [4]:
df2

    A   B   C   D
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5

df1과 df2를 위아래로 합치려고 한다

In [5]:
df12a0 = pd.concat([df1, df2])    # axis의 default는 0
df12a0

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5

In [6]:
df3 = pd.DataFrame({'E': ['A6', 'A7', 'A8'],
    'F': ['B6', 'B7', 'B8'],
    'G': ['C6', 'C7', 'C8'],
    'H': ['D6', 'D7', 'D8']},
    index=[0, 1, 2])


df4 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
     'B': ['B0', 'B1', 'B2'],
     'C': ['C0', 'C1', 'C2'],
     'E': ['E0', 'E1', 'E2']},
     index=[0, 1, 3])

In [7]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2

In [8]:
df3

    E   F   G   H
0  A6  B6  C6  D6
1  A7  B7  C7  D7
2  A8  B8  C8  D8

In [9]:
pd.concat([df1, df3])

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     A    B    C    D    E    F    G    H
0   A0   B0   C0   D0  NaN  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN  NaN
2   A2   B2   C2   D2  NaN  NaN  NaN  NaN
0  NaN  NaN  NaN  NaN   A6   B6   C6   D6
1  NaN  NaN  NaN  NaN   A7   B7   C7   D7
2  NaN  NaN  NaN  NaN   A8   B8   C8   D8

* 위아래로 합치려면(axis=0) 열의 이름이 같아야 한다. 그렇지 않으면 위 코드의 결과처럼 제대로 합쳐지지 않는다.

In [10]:
pd.concat([df1, df3], axis=1)

    A   B   C   D   E   F   G   H
0  A0  B0  C0  D0  A6  B6  C6  D6
1  A1  B1  C1  D1  A7  B7  C7  D7
2  A2  B2  C2  D2  A8  B8  C8  D8

In [11]:
df13a1 = pd.concat([df1, df3], axis=1)

### join

In [12]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2

In [13]:
df4

    A   B   C   E
0  A0  B0  C0  E0
1  A1  B1  C1  E1
3  A2  B2  C2  E2

In [18]:
df14o = pd.concat([df1, df4])    # join은 default가 outer(합집합)
df14o

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

    A   B   C    D    E
0  A0  B0  C0   D0  NaN
1  A1  B1  C1   D1  NaN
2  A2  B2  C2   D2  NaN
0  A0  B0  C0  NaN   E0
1  A1  B1  C1  NaN   E1
3  A2  B2  C2  NaN   E2

In [19]:
df14i = pd.concat([df1, df4], join="inner")    # join이 inner면 교집합
df14i

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
0  A0  B0  C0
1  A1  B1  C1
3  A2  B2  C2

In [20]:
pd.concat([df1, df4], axis=1)

     A    B    C    D    A    B    C    E
0   A0   B0   C0   D0   A0   B0   C0   E0
1   A1   B1   C1   D1   A1   B1   C1   E1
2   A2   B2   C2   D2  NaN  NaN  NaN  NaN
3  NaN  NaN  NaN  NaN   A2   B2   C2   E2

In [22]:
df14o1 = pd.concat([df1, df4], axis=1, join="outer")

In [24]:
df14i1 = pd.concat([df1, df4], axis=1, join="inner")
df14i1

    A   B   C   D   A   B   C   E
0  A0  B0  C0  D0  A0  B0  C0  E0
1  A1  B1  C1  D1  A1  B1  C1  E1

### join_axes

In [28]:
# join_axes: 특정 데이터프레임의 인덱스를 사용하고자 할 때
df14ja1 = pd.concat([df1, df4], axis=1, join_axes=[df1.index])
df14ja1

    A   B   C   D    A    B    C    E
0  A0  B0  C0  D0   A0   B0   C0   E0
1  A1  B1  C1  D1   A1   B1   C1   E1
2  A2  B2  C2  D2  NaN  NaN  NaN  NaN

### ignore_index

In [29]:
df5 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
     'B': ['B0', 'B1', 'B2'],
     'C': ['C0', 'C1', 'C2'],
     'D': ['D0', 'D1', 'D2']},
     index=['r0', 'r1', 'r2'])


df6 = pd.DataFrame({'A': ['A3', 'A4', 'A5'],
     'B': ['B3', 'B4', 'B5'],
     'C': ['C3', 'C4', 'C5'],
     'D': ['D3', 'D4', 'D5']},
     index=['r3', 'r4', 'r5'])

In [30]:
df5

     A   B   C   D
r0  A0  B0  C0  D0
r1  A1  B1  C1  D1
r2  A2  B2  C2  D2

In [31]:
df6

     A   B   C   D
r3  A3  B3  C3  D3
r4  A4  B4  C4  D4
r5  A5  B5  C5  D5

In [33]:
pd.concat([df5, df6])     # ignore_index는 default가 False

     A   B   C   D
r0  A0  B0  C0  D0
r1  A1  B1  C1  D1
r2  A2  B2  C2  D2
r3  A3  B3  C3  D3
r4  A4  B4  C4  D4
r5  A5  B5  C5  D5

In [34]:
pd.concat([df5, df6], ignore_index=True)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5

### keys

keys = 계층적 index를 구성

In [37]:
df56wk = pd.concat([df5, df6], keys=["df5", "df6"])
df56wk

         A   B   C   D
df5 r0  A0  B0  C0  D0
    r1  A1  B1  C1  D1
    r2  A2  B2  C2  D2
df6 r3  A3  B3  C3  D3
    r4  A4  B4  C4  D4
    r5  A5  B5  C5  D5

In [38]:
df56wk.ix["df5"]

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

     A   B   C   D
r0  A0  B0  C0  D0
r1  A1  B1  C1  D1
r2  A2  B2  C2  D2

In [39]:
df56wk.ix["df5"][0:2]

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

     A   B   C   D
r0  A0  B0  C0  D0
r1  A1  B1  C1  D1

In [42]:
pd.concat([df5, df6], keys=["df5", "df6"], names=["dfname", "rownum"])

                A   B   C   D
dfname rownum
df5    r0      A0  B0  C0  D0
       r1      A1  B1  C1  D1
       r2      A2  B2  C2  D2
df6    r3      A3  B3  C3  D3
       r4      A4  B4  C4  D4
       r5      A5  B5  C5  D5

### verify_integrity

In [43]:
df7 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
     'B': ['B0', 'B1', 'B2'],
     'C': ['C0', 'C1', 'C2'],
     'D': ['D0', 'D1', 'D2']},
     index=['r0', 'r1', 'r2'])

df8 = pd.DataFrame({'A': ['A2', 'A3', 'A4'],
     'B': ['B2', 'B3', 'B4'],
     'C': ['C2', 'C3', 'C4'],
     'D': ['D2', 'D3', 'D4']},
     index=['r2', 'r3', 'r4'])

In [44]:
df7

     A   B   C   D
r0  A0  B0  C0  D0
r1  A1  B1  C1  D1
r2  A2  B2  C2  D2

In [45]:
df8

     A   B   C   D
r2  A2  B2  C2  D2
r3  A3  B3  C3  D3
r4  A4  B4  C4  D4

In [47]:
pd.concat([df7, df8])    # r2가 2번 나온다

     A   B   C   D
r0  A0  B0  C0  D0
r1  A1  B1  C1  D1
r2  A2  B2  C2  D2
r2  A2  B2  C2  D2
r3  A3  B3  C3  D3
r4  A4  B4  C4  D4

In [49]:
pd.concat([df7, df8], verify_integrity=True)

ValueError: Indexes have overlapping values: Index(['r2'], dtype='object')

* verify_integrity를 통해 중복되는 행이 있는지 확인할 수 있다 (즉, 중복되는 행이 있으면 에러메세지를 보여준다)

# 데이터 프레임과 시리즈를 합치기 (concat과 append 함수를 이용해서)

데이터프레임과 시리즈를 합치면 결과물은 데이터프레임이 된다.

In [50]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
    'B': ['B0', 'B1', 'B2'],
    'C': ['C0', 'C1', 'C2'],
    'D': ['D0', 'D1', 'D2']},
    index=[0, 1, 2])

In [51]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2

In [52]:
ser = pd.Series(["s1", "s2", "s3"])
ser

0    s1
1    s2
2    s3
dtype: object

## concat 함수 이용

In [53]:
pd.concat([df1, ser])

     A    B    C    D    0
0   A0   B0   C0   D0  NaN
1   A1   B1   C1   D1  NaN
2   A2   B2   C2   D2  NaN
0  NaN  NaN  NaN  NaN   s1
1  NaN  NaN  NaN  NaN   s2
2  NaN  NaN  NaN  NaN   s3

In [54]:
pd.concat([df1, ser], axis=1)

    A   B   C   D   0
0  A0  B0  C0  D0  s1
1  A1  B1  C1  D1  s2
2  A2  B2  C2  D2  s3

In [55]:
ser = pd.Series(["s1", "s2", "s3"], name="E")
pd.concat([df1, ser], axis=1)

    A   B   C   D   E
0  A0  B0  C0  D0  s1
1  A1  B1  C1  D1  s2
2  A2  B2  C2  D2  s3

In [56]:
pd.concat([df1, ser], axis=1, ignore_index=True)

    0   1   2   3   4
0  A0  B0  C0  D0  s1
1  A1  B1  C1  D1  s2
2  A2  B2  C2  D2  s3

In [58]:
s1 = pd.Series([3, 4, 5])
s2 = pd.Series([3, 4, 5])
s3 = pd.Series([3, 4, 5])

In [59]:
pd.concat([s1, s2, s3])

0    3
1    4
2    5
0    3
1    4
2    5
0    3
1    4
2    5
dtype: int64

In [61]:
pd.concat([s1, s2, s3], axis=1)

   0  1  2
0  3  3  3
1  4  4  4
2  5  5  5

In [62]:
pd.concat([s1, s2, s3], axis=1, keys=["c1", "c2", "c3"])

   c1  c2  c3
0   3   3   3
1   4   4   4
2   5   5   5

# Merge를 이용해 합치기

merge 함수에서 자주 사용하는 옵션: how, on
* how (left, right, inner(기본값), outer)
* on: 병합 기준 변수

In [63]:
from pandas import DataFrame

dfleft = DataFrame({'KEY': ['K0', 'K1', 'K2', 'K3'],
    'A': ['A0', 'A1', 'A2', 'A3'],
    'B': ['B0', 'B1', 'B2', 'B3']})


dfright = DataFrame({'KEY': ['K2', 'K3', 'K4', 'K5'],
    'C': ['C2', 'C3', 'C4', 'C5'],
    'D': ['D2', 'D3', 'D4', 'D5']})

In [64]:
dfleft

  KEY   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [65]:
dfright

  KEY   C   D
0  K2  C2  D2
1  K3  C3  D3
2  K4  C4  D4
3  K5  C5  D5

## how

In [66]:
pd.merge(dfleft, dfright)

  KEY   A   B   C   D
0  K2  A2  B2  C2  D2
1  K3  A3  B3  C3  D3

* 그냥 merge하면 공통적으로 존재하는 값을 찾아서 그걸 기준으로 how의 default인 inner join (교집합) 으로 합친다.

In [67]:
pd.merge(dfleft, dfright, on="KEY")

  KEY   A   B   C   D
0  K2  A2  B2  C2  D2
1  K3  A3  B3  C3  D3

In [69]:
dfmhr = pd.merge(dfleft, dfright, on="KEY", how="left")
dfmhr

  KEY   A   B    C    D
0  K0  A0  B0  NaN  NaN
1  K1  A1  B1  NaN  NaN
2  K2  A2  B2   C2   D2
3  K3  A3  B3   C3   D3

* how에서 left를 설정하면, 합쳐지는 두 객체 중 왼쪽에 있는 객체를 기준으로 합친다는 것

In [70]:
pd.merge(dfleft, dfright, on="KEY", how="inner")

  KEY   A   B   C   D
0  K2  A2  B2  C2  D2
1  K3  A3  B3  C3  D3

In [71]:
pd.merge(dfleft, dfright, on="KEY", how="outer")

  KEY    A    B    C    D
0  K0   A0   B0  NaN  NaN
1  K1   A1   B1  NaN  NaN
2  K2   A2   B2   C2   D2
3  K3   A3   B3   C3   D3
4  K4  NaN  NaN   C4   D4
5  K5  NaN  NaN   C5   D5

# index를 이용해서 합치기

In [73]:
dfleft = DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3']},
                   index=['K0', 'K1', 'K2', 'K3'])


dfright = DataFrame({'C': ['C2', 'C3', 'C4', 'C5'],
                     'D': ['D2', 'D3', 'D4', 'D5']},
                   index=['K2', 'K3', 'K4', 'K5'])

In [74]:
dfleft

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2
K3  A3  B3

In [76]:
dfright

     C   D
K2  C2  D2
K3  C3  D3
K4  C4  D4
K5  C5  D5

## index와 merge를 사용할 때

In [77]:
pd.merge(dfleft, dfright)

MergeError: No common columns to perform merge on. Merge options: left_on=None, right_on=None, left_index=False, right_index=False

* 공통적으로 존재하는 값이 없기 때문에 에러가 난다 (K2, K3은 값이 아니라 인덱스이기 때문)

In [79]:
pd.merge(dfleft, dfright, left_index=True, right_index=True)    # 왼쪽, 오른쪽 프레임 모두 다 존재하는 인덱스에 대한 데이터 병합을 수행하겠다

     A   B   C   D
K2  A2  B2  C2  D2
K3  A3  B3  C3  D3

In [80]:
pd.merge(dfleft, dfright, left_index=True, right_index=True, how="left")

     A   B    C    D
K0  A0  B0  NaN  NaN
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2
K3  A3  B3   C3   D3

## index와 join을 사용할 때

In [81]:
dfleft.join(dfright, how="left")

     A   B    C    D
K0  A0  B0  NaN  NaN
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2
K3  A3  B3   C3   D3

# 결측치 확인

In [82]:
dfleft = pd.DataFrame({'KEY': ['K0', 'K1', 'K2', 'K3'],
    'A': ['A0', 'A1', 'A2', 'A3'],
    'B': ['B0', 'B1', 'B2', 'B3']})


dfright = pd.DataFrame({'KEY': ['K2', 'K3', 'K4', 'K5'],
    'C': ['C2', 'C3', 'C4', 'C5'],
    'D': ['D2', 'D3', 'D4', 'D5']})

In [85]:
dfa = pd.merge(dfleft, dfright, on="KEY", how="outer")
dfa

  KEY    A    B    C    D
0  K0   A0   B0  NaN  NaN
1  K1   A1   B1  NaN  NaN
2  K2   A2   B2   C2   D2
3  K3   A3   B3   C3   D3
4  K4  NaN  NaN   C4   D4
5  K5  NaN  NaN   C5   D5

## isnull 함수

In [86]:
pd.isnull(dfa)

     KEY      A      B      C      D
0  False  False  False   True   True
1  False  False  False   True   True
2  False  False  False  False  False
3  False  False  False  False  False
4  False   True   True  False  False
5  False   True   True  False  False

In [87]:
dfa.isnull()

     KEY      A      B      C      D
0  False  False  False   True   True
1  False  False  False   True   True
2  False  False  False  False  False
3  False  False  False  False  False
4  False   True   True  False  False
5  False   True   True  False  False

In [89]:
pd.notnull(dfa)
dfa.notnull()

    KEY      A      B      C      D
0  True   True   True  False  False
1  True   True   True  False  False
2  True   True   True   True   True
3  True   True   True   True   True
4  True  False  False   True   True
5  True  False  False   True   True

In [90]:
dfa.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6 entries, 0 to 5
Data columns (total 5 columns):
KEY    6 non-null object
A      4 non-null object
B      4 non-null object
C      4 non-null object
D      4 non-null object
dtypes: object(5)
memory usage: 288.0+ bytes

In [93]:
dfleft = pd.DataFrame({'KEY': ['K0', 'K1', 'K2', 'K3'],
    'A': ['A0', 'A1', 'A2', 'A3'],
    'B': [1.1, 2.2, 3.3, 4.4]})


dfright = pd.DataFrame({'KEY': ['K2', 'K3', 'K4', 'K5'],
    'C': ['C2', 'C3', 'C4', 'C5'],
    'D': ['D2', 'D3', 'D4', 'D5']})

In [94]:
dfa = pd.merge(dfleft, dfright, on="KEY", how="outer")
dfa.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6 entries, 0 to 5
Data columns (total 5 columns):
KEY    6 non-null object
A      4 non-null object
B      4 non-null float64
C      4 non-null object
D      4 non-null object
dtypes: float64(1), object(4)
memory usage: 288.0+ bytes

## 결측값 넣기

In [98]:
dfa

  KEY    A    B    C    D
0  K0   A0  1.1  NaN  NaN
1  K1   A1  2.2  NaN  NaN
2  K2   A2  3.3   C2   D2
3  K3   A3  4.4   C3   D3
4  K4  NaN  NaN   C4   D4
5  K5  NaN  NaN   C5   D5

### 인덱스로 원하는 위치 찾기

In [95]:
dfa.ix[0]

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

KEY     K0
A       A0
B      1.1
C      NaN
D      NaN
Name: 0, dtype: object

In [96]:
dfa.ix[0, "B"]

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

1.1

In [97]:
dfa.ix[[0,1], "B"]

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

0    1.1
1    2.2
Name: B, dtype: float64

In [100]:
dfa.ix[[0,1], ["A", "B"]]

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

    A    B
0  A0  1.1
1  A1  2.2

### 결측값 넣기

In [101]:
dfa.ix[[0,1], ["A", "B"]] = None

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [102]:
dfa

  KEY     A    B    C    D
0  K0  None  NaN  NaN  NaN
1  K1  None  NaN  NaN  NaN
2  K2    A2  3.3   C2   D2
3  K3    A3  4.4   C3   D3
4  K4   NaN  NaN   C4   D4
5  K5   NaN  NaN   C5   D5

* None과 NaN 둘 다 의미는 결측값으로 같다
* 근데 자료형이 문자인 경우에는 None으로 들어가고 자료형이 숫자인 경우에는 NaN으로 들어간다

In [104]:
dfa.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6 entries, 0 to 5
Data columns (total 5 columns):
KEY    6 non-null object
A      2 non-null object
B      2 non-null float64
C      4 non-null object
D      4 non-null object
dtypes: float64(1), object(4)
memory usage: 448.0+ bytes

### 결측값 개수 조사하기

In [105]:
dfa.isnull()

     KEY      A      B      C      D
0  False   True   True   True   True
1  False   True   True   True   True
2  False  False  False  False  False
3  False  False  False  False  False
4  False   True   True  False  False
5  False   True   True  False  False

In [107]:
dfa.isnull().sum()     # 중요! 각 column별로 null의 개수 찾는 구문

KEY    0
A      4
B      4
C      2
D      2
dtype: int64

In [109]:
dfa["A"].isnull().sum()    # dfa의 A열에 있는 결측값 개수

4

In [110]:
dfa.notnull().sum()

KEY    6
A      2
B      2
C      4
D      4
dtype: int64

In [111]:
dfa.isnull().sum(1)    # sum(axis=1)이면 행 단위로 결측값의 개수를 구하게 됨 (sum axis의 default는 0, 즉 열 단위)

0    4
1    4
2    0
3    0
4    2
5    2
dtype: int64

In [112]:
dfa

  KEY     A    B    C    D
0  K0  None  NaN  NaN  NaN
1  K1  None  NaN  NaN  NaN
2  K2    A2  3.3   C2   D2
3  K3    A3  4.4   C3   D3
4  K4   NaN  NaN   C4   D4
5  K5   NaN  NaN   C5   D5

### 파생변수 만들기

In [113]:
dfa["NaN_Num"] = dfa.isnull().sum(1)    # column 추가 (파생변수 만들기)
dfa

  KEY     A    B    C    D  NaN_Num
0  K0  None  NaN  NaN  NaN        4
1  K1  None  NaN  NaN  NaN        4
2  K2    A2  3.3   C2   D2        0
3  K3    A3  4.4   C3   D3        0
4  K4   NaN  NaN   C4   D4        2
5  K5   NaN  NaN   C5   D5        2

In [114]:
dfa["NotNaN_Num"] = dfa.notnull().sum(1)
dfa

  KEY     A    B    C    D  NaN_Num  NotNaN_Num
0  K0  None  NaN  NaN  NaN        4           2
1  K1  None  NaN  NaN  NaN        4           2
2  K2    A2  3.3   C2   D2        0           6
3  K3    A3  4.4   C3   D3        0           6
4  K4   NaN  NaN   C4   D4        2           4
5  K5   NaN  NaN   C5   D5        2           4

# 결측값 연산

In [115]:
df = pd.DataFrame(np.arange(10).reshape(5,2),
                 columns=["c1", "c2"],
                 index=["a", "b", "c", "d", "e"])
df

   c1  c2
a   0   1
b   2   3
c   4   5
d   6   7
e   8   9

In [119]:
# b, e행 c1열에 None, b, c행 c2열에도 None 대입하기
df.ix[["b", "e"], "c1"] = None
df.ix[["b", "c"], "c2"] = None
df

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  This is separate from the ipykernel package so we can avoid doing imports until

    c1   c2
a  0.0  1.0
b  NaN  NaN
c  4.0  NaN
d  6.0  7.0
e  NaN  9.0

In [120]:
df.sum()

c1    10.0
c2    17.0
dtype: float64

* sum의 default axis는 0이므로 열 단위로 합쳐진다
* NaN은 sum에서 0으로 취급된다

In [121]:
df["c1"].sum()

10.0

In [122]:
df["c1"].cumsum()

a     0.0
b     NaN
c     4.0
d    10.0
e     NaN
Name: c1, dtype: float64

* cumsum: cumulative sum. 누적합 구하기. 여기서도 역시 NaN은 0으로 처리된다.

In [123]:
df.mean()

c1    3.333333
c2    5.666667
dtype: float64

* mean에서는 NaN이 0으로 취급되지 않고 아예 분석에서 제외가 된다.

In [124]:
df.std()

c1    3.055050
c2    4.163332
dtype: float64

* 마찬가지로 표준편차 구할 때에도 NaN은 아예 제외가 된다

In [125]:
df.mean(1)    # 행 단위로 평균 구하기

a    0.5
b    NaN
c    4.0
d    6.5
e    9.0
dtype: float64

In [126]:
df

    c1   c2
a  0.0  1.0
b  NaN  NaN
c  4.0  NaN
d  6.0  7.0
e  NaN  9.0

In [128]:
df["c3"] = df["c1"]+df["c2"]
df

    c1   c2    c3
a  0.0  1.0   1.0
b  NaN  NaN   NaN
c  4.0  NaN   NaN
d  6.0  7.0  13.0
e  NaN  9.0   NaN

* 데이터프레임에서 컬럼 간 연산 시, 어느 하나라도 NaN이 존재하면 결과도 NaN이 된다.

# 결측값을 다른 값으로 대체하기

결측값을 대체할 때는 fill과 fillna 함수를 사용한다

## 데이터프레임 만들고 결측값 넣기

In [129]:
df = pd.DataFrame(np.random.randn(5,3), columns=["c1", "c2", "c3"])
df

         c1        c2        c3
0  1.399146  1.737391 -0.717897
1  0.329926  0.247291 -0.744043
2 -0.062855  0.835912  0.824604
3  0.707980  0.848959 -0.591337
4  0.588618  0.941944 -0.524595

In [133]:
df.ix[0, 0] = None    # pandas 버전 결측값 넣기
df

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

         c1        c2        c3
0       NaN  1.737391 -0.717897
1  0.329926  0.247291 -0.744043
2 -0.062855  0.835912  0.824604
3  0.707980  0.848959 -0.591337
4  0.588618  0.941944 -0.524595

In [135]:
df.ix[1, [0, 2]] = np.nan    # numpy버전 결측값 넣기
df

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

         c1        c2        c3
0       NaN  1.737391 -0.717897
1       NaN  0.247291       NaN
2 -0.062855  0.835912  0.824604
3  0.707980  0.848959 -0.591337
4  0.588618  0.941944 -0.524595

In [136]:
df.ix[2, 1] = np.nan
df.ix[3, 1] = np.nan
df.ix[4, 2] = np.nan
df

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.
C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  This is separate from the ipykernel package so we can avoid doing imports until

         c1        c2        c3
0       NaN  1.737391 -0.717897
1       NaN  0.247291       NaN
2 -0.062855       NaN  0.824604
3  0.707980       NaN -0.591337
4  0.588618  0.941944       NaN

## 결측값 대체

### fillna함수

In [137]:
df.fillna(0)

         c1        c2        c3
0  0.000000  1.737391 -0.717897
1  0.000000  0.247291  0.000000
2 -0.062855  0.000000  0.824604
3  0.707980  0.000000 -0.591337
4  0.588618  0.941944  0.000000

In [138]:
df.fillna("missing")

          c1        c2        c3
0    missing   1.73739 -0.717897
1    missing  0.247291   missing
2 -0.0628546   missing  0.824604
3    0.70798   missing -0.591337
4   0.588618  0.941944   missing

In [139]:
df

         c1        c2        c3
0       NaN  1.737391 -0.717897
1       NaN  0.247291       NaN
2 -0.062855       NaN  0.824604
3  0.707980       NaN -0.591337
4  0.588618  0.941944       NaN

In [140]:
df.fillna(method="ffill")

         c1        c2        c3
0       NaN  1.737391 -0.717897
1       NaN  0.247291 -0.717897
2 -0.062855  0.247291  0.824604
3  0.707980  0.247291 -0.591337
4  0.588618  0.941944 -0.591337

* ffill을 하면 위에서 아래로 값이 복사되어 채워진다

In [141]:
df.fillna(method="ffill", limit=1)

         c1        c2        c3
0       NaN  1.737391 -0.717897
1       NaN  0.247291 -0.717897
2 -0.062855  0.247291  0.824604
3  0.707980       NaN -0.591337
4  0.588618  0.941944 -0.591337

* limit=1을 넣으면 ffill 될 때 한개만 채워진다

In [142]:
df

         c1        c2        c3
0       NaN  1.737391 -0.717897
1       NaN  0.247291       NaN
2 -0.062855       NaN  0.824604
3  0.707980       NaN -0.591337
4  0.588618  0.941944       NaN

In [143]:
df.mean()

c1    0.411248
c2    0.975542
c3   -0.161543
dtype: float64

In [145]:
# 평균으로 결측값 대체하기
df.fillna(df.mean())

         c1        c2        c3
0  0.411248  1.737391 -0.717897
1  0.411248  0.247291 -0.161543
2 -0.062855  0.975542  0.824604
3  0.707980  0.975542 -0.591337
4  0.588618  0.941944 -0.161543

* 각 열 단위로 구해진 평균값이 NaN 자리에 채워진다.

In [146]:
# c1의 평균으로 NaN을 채우기
df.fillna(df.mean()["c1"])

         c1        c2        c3
0  0.411248  1.737391 -0.717897
1  0.411248  0.247291  0.411248
2 -0.062855  0.411248  0.824604
3  0.707980  0.411248 -0.591337
4  0.588618  0.941944  0.411248

In [147]:
# 결측값을 특정 값으로 대체할 때 numpy의 where 함수 사용하기
df2 = pd.DataFrame({"a1": [1, 2, 3, 4, 5], "a2": [10, 11, 12, 13, 14]})
df2.ix[[1, 3], ["a2"]] = np.nan
df2

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  This is separate from the ipykernel package so we can avoid doing imports until

   a1    a2
0   1  10.0
1   2   NaN
2   3  12.0
3   4   NaN
4   5  14.0

In [154]:
# a3열을 추가하는데, a3열에는 a2열의 값이 NaN이면 a1열의 값으로 a3열을 채우고, a2열이 NaN이 아니면 그냥 a2열의 값으로 a3열을 채우기

# df2["a3"] = np.where(df2["a2"]==None, df2["a1"], df2["a2"])     # 이 구문은 안됨.
df2["a3"] = np.where(df2["a2"].isnull()==True, df2["a1"], df2["a2"])
df2

   a1    a2    a3
0   1  10.0  10.0
1   2   NaN   2.0
2   3  12.0  12.0
3   4   NaN   4.0
4   5  14.0  14.0